Pandas의 고유한 자료 구조 - Seires와 DataFrame

DataFrame은 pd.DataFrame() 함수를 사용하여 정의한다. 여기에 입력되는 데이터는 Python 딕셔너리 혹은 NumPY의 2차원 array등의 형태가 될 수 잇다.

In [67]:
import pandas as pd

data = {"names": ['Hyun', 'Hyun', 'Hyun', 'Charles', "Charles"],
        "year": [2014, 2015, 2016, 2015, 2016],
        "points": [1.5, 1.7, 3.6, 2.4, 2.9]}

df = pd.DataFrame(data)
df

     names  year  points
0     Hyun  2014     1.5
1     Hyun  2015     1.7
2     Hyun  2016     3.6
3  Charles  2015     2.4
4  Charles  2016     2.9

In [68]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [69]:
df.columns

Index(['names', 'year', 'points'], dtype='object')

In [70]:
df.values

array([['Hyun', 2014, 1.5],
       ['Hyun', 2015, 1.7],
       ['Hyun', 2016, 3.6],
       ['Charles', 2015, 2.4],
       ['Charles', 2016, 2.9]], dtype=object)

In [71]:
df2 = pd.DataFrame(data, columns = ['year','names','points','penalty'],
                  index = ['one','two','three','four','five'])

In [72]:
df2

       year    names  points penalty
one    2014     Hyun     1.5     NaN
two    2015     Hyun     1.7     NaN
three  2016     Hyun     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [73]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [74]:
df2.columns

Index(['year', 'names', 'points', 'penalty'], dtype='object')

In [75]:
df2.values

array([[2014, 'Hyun', 1.5, nan],
       [2015, 'Hyun', 1.7, nan],
       [2016, 'Hyun', 3.6, nan],
       [2015, 'Charles', 2.4, nan],
       [2016, 'Charles', 2.9, nan]], dtype=object)

In [76]:
df2.describe()

             year    points
count     5.00000  5.000000
mean   2015.20000  2.420000
std       0.83666  0.864292
min    2014.00000  1.500000
25%    2015.00000  1.700000
50%    2015.00000  2.400000
75%    2016.00000  2.900000
max    2016.00000  3.600000

DataFrame 인덱싱

In [77]:
import pandas as pd
import numpy as np

In [78]:
data = {'names': ['Hyu','Hyu','Hyu','Charles','Charles'],
       'year':[2014,2015,2016,2015,2016],
       'points':[1.5,1.7,3.6,2.4,2.9]}

df = pd.DataFrame(data, columns=['year','names','points','penalty'],
                 index = ['one','two','three','four','five'])

In [79]:
df

       year    names  points penalty
one    2014      Hyu     1.5     NaN
two    2015      Hyu     1.7     NaN
three  2016      Hyu     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [80]:
df['year']

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [81]:
df.year

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [82]:
df[['year', 'points']]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9

In [83]:
df

       year    names  points penalty
one    2014      Hyu     1.5     NaN
two    2015      Hyu     1.7     NaN
three  2016      Hyu     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [84]:
df['penalty'] = [0.1, 0.2, 0.3, 0.4, 0.5]
df

       year    names  points  penalty
one    2014      Hyu     1.5      0.1
two    2015      Hyu     1.7      0.2
three  2016      Hyu     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [85]:
# columns 추가하고 값을 넣을 수 있음
df['zero'] = np.arange(5)
df

       year    names  points  penalty  zero
one    2014      Hyu     1.5      0.1     0
two    2015      Hyu     1.7      0.2     1
three  2016      Hyu     3.6      0.3     2
four   2015  Charles     2.4      0.4     3
five   2016  Charles     2.9      0.5     4

In [86]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [87]:
# 'debt' 열 추가하고, 'val' Series 데이터를 debt 열에 넣는다. 이 때, 인덱스가 같은 것끼리 값이 대입되어진다
df['debt'] = val
df

       year    names  points  penalty  zero  debt
one    2014      Hyu     1.5      0.1     0   NaN
two    2015      Hyu     1.7      0.2     1  -1.2
three  2016      Hyu     3.6      0.3     2   NaN
four   2015  Charles     2.4      0.4     3  -1.5
five   2016  Charles     2.9      0.5     4  -1.7

In [88]:
df = pd.read_csv("./data/loan/accepted_2007_to_2018Q4.csv")
df

C:\Users\human\AppData\Local\Temp\ipykernel_5540\732452169.py:1: DtypeWarning: Columns (0,19,49,59,118,129,130,131,134,135,136,139,145,146,147) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("./data/loan/accepted_2007_to_2018Q4.csv")

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,hardship_payoff_balance_amount,hardship_last_payment_amount,disbursement_method,debt_settlement_flag,debt_settlement_flag_date,settlement_status,settlement_date,settlement_amount,settlement_percentage,settlement_term
0,68407277,NaN,3600.0,3600.0,3600.0,36 months,13.99,123.03,C,C4,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
1,68355089,NaN,24700.0,24700.0,24700.0,36 months,11.99,820.28,C,C1,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2,68341763,NaN,20000.0,20000.0,20000.0,60 months,10.78,432.66,B,B4,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
3,66310712,NaN,35000.0,35000.0,35000.0,60 months,14.85,829.90,C,C5,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
4,68476807,NaN,10400.0,10400.0,10400.0,60 months,22.45,289.91,F,F1,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2260696,88985880,NaN,40000.0,40000.0,40000.0,60 months,10.49,859.56,B,B3,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2260697,88224441,NaN,24000.0,24000.0,24000.0,60 months,14.49,564.56,C,C4,...,NaN,NaN,Cash,Y,Mar-2019,ACTIVE,Mar-2019,10000.0,44.82,1.0
2260698,88215728,NaN,14000.0,14000.0,14000.0,60 months,14.49,329.33,C,C4,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2260699,Total amount funded in policy code 1: 1465324575,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2260700,Total amount funded in policy code 2: 521953170,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [89]:
df2 = df.loc[:, ['loan_amnt', 'loan_status', 'grade', 'int_rate', 'term']]
df2

         loan_amnt  loan_status grade  int_rate        term
0           3600.0   Fully Paid     C     13.99   36 months
1          24700.0   Fully Paid     C     11.99   36 months
2          20000.0   Fully Paid     B     10.78   60 months
3          35000.0      Current     C     14.85   60 months
4          10400.0   Fully Paid     F     22.45   60 months
...            ...          ...   ...       ...         ...
2260696    40000.0      Current     B     10.49   60 months
2260697    24000.0  Charged Off     C     14.49   60 months
2260698    14000.0      Current     C     14.49   60 months
2260699        NaN          NaN   NaN       NaN         NaN
2260700        NaN          NaN   NaN       NaN         NaN

[2260701 rows x 5 columns]

In [90]:
df3 = df2.dropna()
df3

         loan_amnt  loan_status grade  int_rate        term
0           3600.0   Fully Paid     C     13.99   36 months
1          24700.0   Fully Paid     C     11.99   36 months
2          20000.0   Fully Paid     B     10.78   60 months
3          35000.0      Current     C     14.85   60 months
4          10400.0   Fully Paid     F     22.45   60 months
...            ...          ...   ...       ...         ...
2260694    24000.0      Current     C     12.79   60 months
2260695    24000.0      Current     B     10.49   60 months
2260696    40000.0      Current     B     10.49   60 months
2260697    24000.0  Charged Off     C     14.49   60 months
2260698    14000.0      Current     C     14.49   60 months

[2260668 rows x 5 columns]

In [93]:
df3['term'].unique()

array([' 36 months', ' 60 months'], dtype=object)

In [91]:
total_36 = df3.loc[df3['term'] == ' 36 months', 'loan_amnt'].sum()
total_36

20517162875.0

In [92]:
total_60 = df3.loc[df3['term'] == ' 60 months', 'loan_amnt'].sum()
total_60

13498953050.0

In [94]:
df3['loan_status'].unique()

array(['Fully Paid', 'Current', 'Charged Off', 'In Grace Period',
       'Late (31-120 days)', 'Late (16-30 days)', 'Default',
       'Does not meet the credit policy. Status:Fully Paid',
       'Does not meet the credit policy. Status:Charged Off'],
      dtype=object)

In [101]:
# 불량: Charged Off, Default, Does not meet the credit policy. Status:Fully Paid, 
# Does not meet the credit policy. Status:Chared Off, Late (31-120 days), Late(16-30 days)
df4 = df3.copy()
conditions1 = ['Charged Off', 'Late (31-120 days)', 'Late (16-30 days)', 'Default', 'Does not meet the credit policy. Status:Fully Paid','Does not meet the credit policy. Status:Charged Off']
df5 = df4[df4['loan_status'].isin(conditions1)]
df5

         loan_amnt  loan_status grade  int_rate        term
13         18000.0  Charged Off     E     19.48   60 months
25          4225.0  Charged Off     C     14.85   36 months
30         16000.0  Charged Off     C     12.88   36 months
31         24250.0  Charged Off     F     24.24   60 months
33         25000.0  Charged Off     C     13.99   60 months
...            ...          ...   ...       ...         ...
2260673    32000.0  Charged Off     C     13.99   60 months
2260677    11200.0  Charged Off     C     13.49   60 months
2260685    36400.0  Charged Off     C     14.49   60 months
2260691    32000.0  Charged Off     C     14.49   60 months
2260697    24000.0  Charged Off     C     14.49   60 months

[297164 rows x 5 columns]

In [102]:
conditions2 = ['Fully Paid', 'Current', 'In Grace Period']
df6 = df4[df4['loan_status'].isin(conditions2)]
df6

         loan_amnt loan_status grade  int_rate        term
0           3600.0  Fully Paid     C     13.99   36 months
1          24700.0  Fully Paid     C     11.99   36 months
2          20000.0  Fully Paid     B     10.78   60 months
3          35000.0     Current     C     14.85   60 months
4          10400.0  Fully Paid     F     22.45   60 months
...            ...         ...   ...       ...         ...
2260693    24000.0     Current     B     10.49   60 months
2260694    24000.0     Current     C     12.79   60 months
2260695    24000.0     Current     B     10.49   60 months
2260696    40000.0     Current     B     10.49   60 months
2260698    14000.0     Current     C     14.49   60 months

[1963504 rows x 5 columns]

In [111]:
df5['grade'].value_counts()

grade
C    95316
D    67488
B    58711
E    39145
A    15967
F    15508
G     5029
Name: count, dtype: int64

In [112]:
df5['grade'].value_counts(normalize=True)

grade
C    0.320752
D    0.227107
B    0.197571
E    0.131729
A    0.053731
F    0.052187
G    0.016923
Name: proportion, dtype: float64

In [113]:
df6['grade'].value_counts()

grade
B    604846
C    554737
A    417060
D    256936
E     96494
F     26292
G      7139
Name: count, dtype: int64

In [114]:
df6['grade'].value_counts(normalize=True)

grade
B    0.308044
C    0.282524
A    0.212406
D    0.130856
E    0.049144
F    0.013390
G    0.003636
Name: proportion, dtype: float64

In [117]:
df3[['loan_amnt', 'int_rate']].corr()

           loan_amnt  int_rate
loan_amnt   1.000000  0.098082
int_rate    0.098082  1.000000